kubejencdp/kubegencdp.org
* kubegencdp

** Introduction
This article is a first in the series of 3 articles. We will set up continuous delivery pipelines for (Docker) containerized project to Kubernetes (hosted in Google Cloud Platform in our case here).

In the first (current) article we will go through containerizing a simple html project using Docker. Buiding it and deploying it to kubernetes.

In the subsequent articles we will continue the discussion to:

- Setup Continuous Deployment Pipelines of Java Maven Docker application to Kubernetes
- Setup Continuous Deployment Pipelines of Python (flask) Docker application to Kubernetes
- Setup Continuous Deployment Pipelines of Nodejs (Angular5) Docker application to Kubernetes


We target to create a CI CD pipeline with everything as code:

1. Pipeline as code : We use Jenkinsfile to create declarative pipelines
2. Infrastructure as code: We containerize the application using Docker
3. Deployment as code: We use kubernetes as our container orchestrator. Our deployments are controlled via code.

Here is how our pipeline would look like once we are done:


Here is how our cluster would look like once we're done deploying the apps:


** Pre requisites

- As a pre requisite you should be familiar with fundamentals of:
  - Jenkins (we are going to run this app on Jenkins)
  - Docker must be installed on the jenkins server
  - Kubernetes cluster (we will deploy the apps on kubernetes so basic familiarity with kubernetes is essential. Moreover, we would talk through some of the basics of kubernetes so you can walk along)
  - Google Cloud Platform Account (This is optional but good to have. Google Cloud Platform offers 12-month free trial with $300 credit to use with any GCP services. In this article we are using Google Kubernetes engine)
  - google-cloud-sdk is required to operate on Google Cloud Platform Kubernetes Engine.


** Structure of the code

Let us take a look how the code has been structured in our sample.

- src : this directory contain the source code of the application we are going to build and deploy
  - Dockerfile: this file contains the containerization code for our app
  - files: this directory contains the files which might be required by our Dockerfile to build the image. This may contain local yum repo configuration, pip files, npm configurations etc.
- env_vars: this directory contains the property files which can be change to suit your project and your docker/google cloud/kubernetes/openshift account
- Jenkinsfile: this file contains the CI CD pipeline code which will be executed by Jenkins


** Setting up the project

To set up the project to your jenkins, just fork the project and follow the steps below:

*** Updating your project specific variables
 
The project is parameterized with parameters defined in env_vars/project.properties file. 
Let us take a look at some of the parameters here:

| Parameter                     | Function                                                                                                                                                                                                              | Example                                                                     |
| APP_NAME                      | The application name - this will be used to create image name in jenkins file                                                                                                                                         | kubejencdp                                                                  |
| PROJECT_NAME                  | name of project                                                                                                                                                                                                       | amitthk                                                                     |
| DOCKER_REGISTRY_URL           | URL of the docker registry. e.g. we are using docker hub here                                                                                                                                                         | registry.hub.docker.com                                                     |
| RELEASE_TAG                   | Release tag for docker image. This can be taken from release branch name also                                                                                                                                         | 1.0.0                                                                       |
| DOCKER_PROJECT_NAMESPACE      | Docker project namespace.                                                                                                                                                                                             | e.g. my accound on docker hub is amitthk which is also my default namespace |
| JENKINS_DOCKER_CREDENTIALS_ID | This is the username password credential which will be added to Jenkins for login to docker registry.(If you are using openshift, you may want to login with $(oc whoami -t) for token                                | JENKINS_DOCKER_CREDENTIALS_ID                                               |
| JENKINS_GCLOUD_CRED_ID        | This is the google cloud platform service account key which is added to Jenkins as a file credential. For more information please refer here https://cloud.google.com/iam/docs/creating-managing-service-account-keys | JENKINS_GCLOUD_CRED_ID                                                      |
| JENKINS_GCLOUD_CRED_LOCATION  | unused.  (If you prefer to not add file credential to jenkins and to store the service account key at jenkins and directly access from slave then use this)                                                           | /var/lib/jenkins/lateral-ceiling-220011-5c9f0bd7782f.json                   |
| GCLOUD_PROJECT_ID             | This is the google cloud project id                                                                                                                                                                                   | lateral-ceiling-220011                                                      |
| GCLOUD_K8S_CLUSTER_NAME       | This is our cluster name on google cloud                                                                                                                                                                              | pyfln-k8s-cluster-dev                                                       |
|                               |                                                                                                                                                                                                                       |                                                                             |
|                               |                                                                                                                                                                                                                       |                                                                             |

