kubejencdp/kubegencdp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>kubegencdp</title>
<!-- 2018-12-17 Mon 05:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">kubegencdp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. kubegencdp</a>
<ul>
<li><a href="#sec-1-1">1.1. Introduction</a></li>
<li><a href="#sec-1-2">1.2. Pre requisites</a></li>
<li><a href="#sec-1-3">1.3. Structure of the code</a></li>
<li><a href="#sec-1-4">1.4. Setting up the project</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Updating your project specific variables</a></li>
<li><a href="#sec-1-4-2">1.4.2. Adding credentials to Jenkins</a></li>
<li><a href="#sec-1-4-3">1.4.3. Creating the pipeline</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Understanding the code</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Dockerfile</a></li>
<li><a href="#sec-1-5-2">1.5.2. Kubernetes - Deployment, Service, Ingress</a></li>
<li><a href="#sec-1-5-3">1.5.3. Jenkinsfile</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> kubegencdp</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This article is a first in the series of 3 articles. We will set up continuous delivery pipelines for (Docker) containerized project to Kubernetes (hosted in Google Cloud Platform in our case here).
</p>

<p>
In the first (current) article we will go through containerizing a simple html project using Docker. Buiding it and deploying it to kubernetes.
</p>

<p>
In the subsequent articles we will continue the discussion to:
</p>

<ul class="org-ul">
<li>Setup Continuous Deployment Pipelines of Java Maven Docker application to Kubernetes
</li>
<li>Setup Continuous Deployment Pipelines of Python (flask) Docker application to Kubernetes
</li>
<li>Setup Continuous Deployment Pipelines of Nodejs (Angular5) Docker application to Kubernetes
</li>
</ul>


<p>
We target to create a CI CD pipeline with everything as code:
</p>

<ol class="org-ol">
<li>Pipeline as code : We use Jenkinsfile to create declarative pipelines
</li>
<li>Infrastructure as code: We containerize the application using Docker
</li>
<li>Deployment as code: We use kubernetes as our container orchestrator. Our deployments are controlled via code.
</li>
</ol>

<p>
Here is how our pipeline would look like once we are done:
</p>


<p>
Here is how our cluster would look like once we're done deploying the apps:
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Pre requisites</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>As a pre requisite you should be familiar with fundamentals of:
<ul class="org-ul">
<li>Jenkins (we are going to run this app on Jenkins)
</li>
<li>Docker must be installed on the jenkins server
</li>
<li>Kubernetes cluster (we will deploy the apps on kubernetes so basic familiarity with kubernetes is essential. Moreover, we would talk through some of the basics of kubernetes so you can walk along)
</li>
<li>Google Cloud Platform Account (This is optional but good to have. Google Cloud Platform offers 12-month free trial with $300 credit to use with any GCP services. In this article we are using Google Kubernetes engine)
</li>
<li>google-cloud-sdk is required to operate on Google Cloud Platform Kubernetes Engine.
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Structure of the code</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Let us take a look how the code has been structured in our sample.
</p>

<ul class="org-ul">
<li>src : this directory contain the source code of the application we are going to build and deploy
<ul class="org-ul">
<li>Dockerfile: this file contains the containerization code for our app
</li>
<li>files: this directory contains the files which might be required by our Dockerfile to build the image. This may contain local yum repo configuration, pip files, npm configurations etc.
</li>
</ul>
</li>
<li>env<sub>vars</sub>: this directory contains the property files which can be change to suit your project and your docker/google cloud/kubernetes/openshift account
</li>
<li>Jenkinsfile: this file contains the CI CD pipeline code which will be executed by Jenkins
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Setting up the project</h3>
<div class="outline-text-3" id="text-1-4">
<p>
To set up the project to your jenkins, just fork the project and follow the steps below:
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Updating your project specific variables</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
The project is parameterized with parameters defined in env<sub>vars</sub>/project.properties file. 
Let us take a look at some of the parameters here:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Parameter</td>
<td class="left">Function</td>
<td class="left">Example</td>
</tr>

<tr>
<td class="left">APP<sub>NAME</sub></td>
<td class="left">The application name - this will be used to create image name in jenkins file</td>
<td class="left">kubejencdp</td>
</tr>

<tr>
<td class="left">PROJECT<sub>NAME</sub></td>
<td class="left">name of project</td>
<td class="left">amitthk</td>
</tr>

<tr>
<td class="left">DOCKER<sub>REGISTRY</sub><sub>URL</sub></td>
<td class="left">URL of the docker registry. e.g. we are using docker hub here</td>
<td class="left">registry.hub.docker.com</td>
</tr>

<tr>
<td class="left">RELEASE<sub>TAG</sub></td>
<td class="left">Release tag for docker image. This can be taken from release branch name also</td>
<td class="left">1.0.0</td>
</tr>

<tr>
<td class="left">DOCKER<sub>PROJECT</sub><sub>NAMESPACE</sub></td>
<td class="left">Docker project namespace.</td>
<td class="left">e.g. my accound on docker hub is amitthk which is also my default namespace</td>
</tr>

<tr>
<td class="left">JENKINS<sub>DOCKER</sub><sub>CREDENTIALS</sub><sub>ID</sub></td>
<td class="left">This is the username password credential which will be added to Jenkins for login to docker registry.(If you are using openshift, you may want to login with $(oc whoami -t) for token</td>
<td class="left">JENKINS<sub>DOCKER</sub><sub>CREDENTIALS</sub><sub>ID</sub></td>
</tr>

<tr>
<td class="left">JENKINS<sub>GCLOUD</sub><sub>CRED</sub><sub>ID</sub></td>
<td class="left">This is the google cloud platform service account key which is added to Jenkins as a file credential. For more information please refer here <a href="https://cloud.google.com/iam/docs/creating-managing-service-account-keys">https://cloud.google.com/iam/docs/creating-managing-service-account-keys</a></td>
<td class="left">JENKINS<sub>GCLOUD</sub><sub>CRED</sub><sub>ID</sub></td>
</tr>

<tr>
<td class="left">JENKINS<sub>GCLOUD</sub><sub>CRED</sub><sub>LOCATION</sub></td>
<td class="left">unused.  (If you prefer to not add file credential to jenkins and to store the service account key at jenkins and directly access from slave then use this)</td>
<td class="left">/var/lib/jenkins/lateral-ceiling-220011-5c9f0bd7782f.json</td>
</tr>

<tr>
<td class="left">GCLOUD<sub>PROJECT</sub><sub>ID</sub></td>
<td class="left">This is the google cloud project id</td>
<td class="left">lateral-ceiling-220011</td>
</tr>

<tr>
<td class="left">GCLOUD<sub>K8S</sub><sub>CLUSTER</sub><sub>NAME</sub></td>
<td class="left">This is our cluster name on google cloud</td>
<td class="left">pyfln-k8s-cluster-dev</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
