kubejencdp/kubegencdp.html

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Adding credentials to Jenkins</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
We need to add two credentials to Jenkins for the pipeline to use. The usage may vary based on your setup.
</p>

<p>
JENKINS<sub>DOCKER</sub><sub>CREDENTIALS</sub><sub>ID</sub> is a username password credential which look like this (Please notice the ID of the credential, I am using the same Id JENKINS<sub>DOCKER</sub><sub>CREDENTIALS</sub><sub>ID</sub> for simplicity):
</p>

<p>
JENKINS<sub>GCLOUD</sub><sub>CRED</sub><sub>ID</sub> is a secret file credential which contains the GCP Key it looks like below:
</p>
</div>
</div>


<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Creating the pipeline</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Now we create a multibranch pipeline (You may decide to go with freestyle/pipeline as per your convenience):
</p>


<p>
We add the repo url according to your project:
</p>


<p>
Once we save, the build should start and we should have the base CICD running as shown in the screen above. Now let us look at the code.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Understanding the code</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Dockerfile</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
This is the first project in series, and we wanted to keep a simple Dockerfile. This dockerfile deploys a basic bootstrap html page into a container. The container uses Apache httpd server to host the static html content.
</p>

<p>
Below is the code it is pretty straightforward:
</p>
<ul class="org-ul">
<li>We set up some environment variables customizable through some of the arguments passed during build.
</li>
<li>Then we copy some of the reqired files for our installation/setup from /app/files directory.
</li>
<li>We install httpd.
</li>
<li>Then we copy the configuration files for httpd to correct location and set permissions
</li>
<li>Then we copy our app (the simple html web page from /app/dist directory to our $APP<sub>BASE</sub><sub>DIR</sub>)
</li>
<li>We setup the entrypoint and start command
</li>
</ul>

<pre class="example">
FROM centos/nodejs-8-centos7

ARG APP_NAME=kubejencdp-ui
ARG APP_BASE_DIR=/var/www/html
ARG APP_BUILD_DIR=/opt/app-root/src/
ARG API_ENDPOINT=http://127.0.0.1:8000
ENV APP_BASE_DIR $APP_BASE_DIR
ENV APP_NAME ${APP_NAME}
ENV API_ENDPOINT ${API_ENDPOINT}
ENV LD_LIBRARY_PATH /opt/rh/rh-nodejs8/root/usr/lib64
ENV PATH /opt/rh/rh-nodejs8/root/usr/bin:/opt/app-root/src/node_modules/.bin/:/opt/app-root/src/.npm-global/bin/:/opt/app-root/src/bin:/opt/app-root/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin
ENV NPM_CONFIG_PREFIX /opt/app-root/src/.npm-global

EXPOSE 8080

USER root

COPY files ${APP_BASE_DIR}/files


#RUN cp ${APP_BASE_DIR}/files/pyfln.rep /etc/yum.repos.d/ \
#    &amp;&amp; update-ca-trust force-enable

RUN yum install -y httpd httpd-tools

RUN cp ${APP_BASE_DIR}/files/npm/npmrc ~/.npmrc \
    &amp;&amp; cp ${APP_BASE_DIR}/files/httpd/httpd.conf /etc/httpd/conf/ \
    &amp;&amp; cp ${APP_BASE_DIR}/files/httpd/default-site.conf /etc/httpd/conf.d/default-site.conf \
    &amp;&amp; chown apache:apache /etc/httpd/conf/httpd.conf \
    &amp;&amp; chmod 755 /etc/httpd/conf/httpd.conf \
    &amp;&amp; chown -R apache:apache /etc/httpd/conf.d \
    &amp;&amp; chmod -R 755 /etc/httpd/conf.d \
    &amp;&amp; touch /etc/httpd/logs/error_log /etc/httpd/logs/access_log \
    &amp;&amp; chmod -R 766 /etc/httpd/logs \
    &amp;&amp; chown -R apache:apache /etc/httpd/logs \
    &amp;&amp; chown -R apache:apache /var/log/httpd \
    &amp;&amp; chmod -R g+rwX /var/log/httpd \
    &amp;&amp; chown -R apache:apache /var/run/httpd \
    &amp;&amp; chmod -R g+rwX /var/log/httpd


COPY dist/. ${APP_BASE_DIR}

RUN cd $APP_BASE_DIR/ \
    &amp;&amp; cp ${APP_BASE_DIR}/files/entrypoint.sh ${APP_BASE_DIR}/ \
    &amp;&amp; chmod -R 0775 $APP_BASE_DIR/ \
    &amp;&amp; chown -R apache:apache $APP_BASE_DIR/

WORKDIR $APP_BASE_DIR
USER apache
ENTRYPOINT ["./entrypoint.sh"]
CMD ["/usr/sbin/httpd","-f","/etc/httpd/conf/httpd.conf","-D","FOREGROUND"]
</pre>
</div>
</div>



<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Kubernetes - Deployment, Service, Ingress</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
In kubernetes the containers are deployed inside Pods. A pod run multiple containers but ideally one pod runs one container.
The smallest unit of scaling in Kubernetes is Pod. When we scale our cluster up or down, we increase or decrease the number of pods.
The pods can be directly routed by services but ideally we deploy them as part of a deployment.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-5-2-1" name="sec-1-5-2-1"></a>Deployment<br  /><div class="outline-text-5" id="text-1-5-2-1">
<p>
The deployment contains  definition for which container image to deploy, how many replicas of the pod we want, which ports we would expose, any environment parameters we need to pass to container etc. 
In addition deployment contains a lot of runtime, storage &amp; networking information for the pod. 
Below is the simple deployment for our application. The variable names prefixed &amp; suffixed with double underscores (e.g. <span class="underline"><span class="underline">APP<sub>NAME</sub></span></span>) will be replaced by process<sub>files</sub>.sh script mentioned later:
</p>

<pre class="example">
apiVersion: extensions/v1beta1
kind: Deployment
metadata:
  name: __APP_NAME__-dc
spec:
  replicas: 1
  template:
    metadata:
      labels:
        app: __APP_NAME__
    spec:
      containers:
      - name: __APP_NAME__-ctr
        image: &gt;-
          __IMAGE__
        imagePullPolicy: Always
        ports:
        - name: httpport
          containerPort: 8080
        env:
          - name: API_ENDPOINT
            value: "http://127.0.0.1:8082/"
</pre>
</div>
</li>

<li><a id="sec-1-5-2-2" name="sec-1-5-2-2"></a>Service<br  /><div class="outline-text-5" id="text-1-5-2-2">
<p>
We can scale up or down our cluster and the pods get added and removed. However, rest of the components (pods/services) interact to our cluster of pods via a reliable endpoint called Service. Service in a way acts as a load balancer and rest of the services can continue interacting with service while underlying pods are created and destroyed.
</p>

<p>
Below is a simple service. This service points to all the pods marked with lable app: <span class="underline"><span class="underline">APP<sub>NAME</sub></span></span> . Please note that labels play an important role in Kubernetes. We labeled our pods such in above deployment. The Labels must match for the service "selector" to work.
</p>

<pre class="example">
apiVersion: v1
kind: Service
metadata:
  labels:
    app: __APP_NAME__
  name: __APP_NAME__-svc
spec:
  ports:
    - name: httpport
      port: 8080
      protocol: TCP
      targetPort: 8080
  selector:
    app: __APP_NAME__
  sessionAffinity: None
  type: NodePort
</pre>
</div>
</li>

<li><a id="sec-1-5-2-3" name="sec-1-5-2-3"></a>Ingress<br  /><div class="outline-text-5" id="text-1-5-2-3">
<p>
Inside the cluster the Pods/services can interact to each other via service endpoints. However, to exposes HTTP and HTTPS routes to services within the cluster to outside world, we use ingress.
Below is a simple ingress which points to our service and also points to the http port it will expose externally. We get a publicly accessible endpoint through ingress.
</p>

<pre class="example">
apiVersion: extensions/v1beta1
kind: Ingress
metadata:
  labels:
    app: __APP_NAME__
  name: __APP_NAME__-ingress
spec:
  backend:
    serviceName: __APP_NAME__-svc
    servicePort: httpport
</pre>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> Jenkinsfile</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Our Jenkinsfile is located at the root of the project and it contains the code for operating various steps in sequence. Let us take a look at the stages one by one:
</p>
</div>
