kubejencdp/kubegencdp.org
**** Checkout and Initialization

We have a declarative pipeline so we get the declarative git checkout SCM as first step. We have a helper function called getEnvVar which reads the values from our env_vars/application.properties file defined above:

#+BEGIN_SRC 

def getEnvVar(String paramName){
    return sh (script: "grep '${paramName}' env_vars/project.properties|cut -d'=' -f2", returnStdout: true).trim();
}

#+END_SRC

And here is how our initialization step looks like. We set the variables here. Most of them come from the application.properties file mentioned above.

#+BEGIN_SRC 
    stage('Init'){
        steps{
            //checkout scm;
        script{
        env.BASE_DIR = pwd()
        env.CURRENT_BRANCH = env.BRANCH_NAME
        env.IMAGE_TAG = getImageTag(env.CURRENT_BRANCH)
        env.APP_NAME= getEnvVar('APP_NAME')
        env.IMAGE_NAME = "${APP_NAME}-app"
        ...
        ...
        }
        }
    }
#+END_SRC

**** Cleanup
We are performing cleanup here, this is optional. We are cleaning up the dangling images and images older than 2 days:

#+BEGIN_SRC 

    stage('Cleanup'){
        steps{
            sh '''
            docker rmi $(docker images -f 'dangling=true' -q) || true
            docker rmi $(docker images | sed 1,2d | awk '{print $3}') || true
            '''
        }

    }

#+END_SRC

**** Building the Docker image

In this step we build the image. We include the DOCKER_REGISTRY_URL in the tag because we will push this image later to our docker registry.

#+BEGIN_SRC 
                sh '''
                docker build -t ${DOCKER_REGISTRY_URL}/${DOCKER_PROJECT_NAMESPACE}/${IMAGE_NAME}:${RELEASE_TAG} --build-arg APP_NAME=${IMAGE_NAME}  -f app/Dockerfile app/.
                '''
#+END_SRC

**** Publishing the image to Docker registry

For this we need to use the username password credentials which we added . We login to docker registry first and publish the image to our docker registry. (registry.hub.docke.com in our case).

#+BEGIN_SRC 
            withCredentials([[$class: 'UsernamePasswordMultiBinding', credentialsId: "${JENKINS_DOCKER_CREDENTIALS_ID}", usernameVariable: 'DOCKER_USERNAME', passwordVariable: 'DOCKER_PASSWD']])
            {
            sh '''
            echo $DOCKER_PASSWD | docker login --username ${DOCKER_USERNAME} --password-stdin ${DOCKER_REGISTRY_URL} 
            docker push ${DOCKER_REGISTRY_URL}/${DOCKER_PROJECT_NAMESPACE}/${IMAGE_NAME}:${RELEASE_TAG}
            docker logout
            '''
            }
#+END_SRC

**** Deploying to Google Cloud Platform Kubernetes Engine

In this step we make use of Google Cloud Platform's gcloud cli to activate the service account.
We also make use of the JENKINS_GCLOUD_CRED_ID secret file credential which we added to Jenkins credentials to get the Google cloud cluster credentials.

We have a utility script named process_files.sh. This utility script replaces the variables which we pass as arguments. Below is how the utility script looks like:

#+BEGIN_SRC 

#!/bin/bash

if (($# <4))
  then
    echo "Usage : $0 <DOCKER_PROJECT_NAME> <APP_NAME> <IMAGE_TAG> <directory containing k8s files>"
    exit 1
fi

PROJECT_NAME=$1
APP_NAME=$2
IMAGE=$3
WORK_DIR=$4

main(){
find $WORK_DIR -name *.yml -type f -exec sed -i.bak1 's#__PROJECT_NAME__#'$PROJECT_NAME'#' {} \;
find $WORK_DIR -name *.yml -type f -exec sed -i.bak2 's#__APP_NAME__#'$APP_NAME'#' {} \;
find $WORK_DIR -name *.yml -type f -exec sed -i.bak3  's#__IMAGE__#'$IMAGE'#' {} \;
}
main

#+END_SRC

Above utility script is placed next to our deployment , service and egress files. Once executed, it will process the files with requisite arguments.

#+BEGIN_SRC 
    stage('Deploy'){
        steps{
        withCredentials([file(credentialsId: "${JENKINS_GCLOUD_CRED_ID}", variable: 'JENKINSGCLOUDCREDENTIAL')])
        {
        sh """
            gcloud auth activate-service-account --key-file=${JENKINSGCLOUDCREDENTIAL}
            gcloud config set compute/zone asia-southeast1-a
            gcloud config set compute/region asia-southeast1
            gcloud config set project ${GCLOUD_PROJECT_ID}
            gcloud container clusters get-credentials ${GCLOUD_K8S_CLUSTER_NAME}
            
            chmod +x $BASE_DIR/k8s/process_files.sh

            cd $BASE_DIR/k8s/
            ./process_files.sh "$GCLOUD_PROJECT_ID" "${IMAGE_NAME}" "${DOCKER_PROJECT_NAMESPACE}/${IMAGE_NAME}:${RELEASE_TAG}" "./${IMAGE_NAME}/"

            cd $BASE_DIR/k8s/${IMAGE_NAME}/.
            kubectl apply -f $BASE_DIR/k8s/${IMAGE_NAME}/

            gcloud auth revoke --all
            """
        }
        }
    }
#+END_SRC

** Conclusion

In this article we looked at how to containerize a simple static web application and continuously deploy it using Jenkins pipeline as code to Kubernetes cluster.
In the articles which follow we would take a look at how to:

- Setup Continuous Deployment Pipelines of Java Maven Project to Kubernetes
- Setup Continuous Deployment Pipelines of Python (flask) project to Kubernetes
- Setup Continuous Deployment Pipelines of Nodejs (Angular5) project to Kubernetes
