kubejencdp/kubegencdp.html

<ol class="org-ol"><li><a id="sec-1-5-3-1" name="sec-1-5-3-1"></a>Checkout and Initialization<br  /><div class="outline-text-5" id="text-1-5-3-1">
<p>
We have a declarative pipeline so we get the declarative git checkout SCM as first step. We have a helper function called getEnvVar which reads the values from our env<sub>vars</sub>/application.properties file defined above:
</p>

<pre class="example">
def getEnvVar(String paramName){
    return sh (script: "grep '${paramName}' env_vars/project.properties|cut -d'=' -f2", returnStdout: true).trim();
}
</pre>

<p>
And here is how our initialization step looks like. We set the variables here. Most of them come from the application.properties file mentioned above.
</p>

<pre class="example">
stage('Init'){
    steps{
        //checkout scm;
    script{
    env.BASE_DIR = pwd()
    env.CURRENT_BRANCH = env.BRANCH_NAME
    env.IMAGE_TAG = getImageTag(env.CURRENT_BRANCH)
    env.APP_NAME= getEnvVar('APP_NAME')
    env.IMAGE_NAME = "${APP_NAME}-app"
    ...
    ...
    }
    }
}
</pre>
</div>
</li>

<li><a id="sec-1-5-3-2" name="sec-1-5-3-2"></a>Cleanup<br  /><div class="outline-text-5" id="text-1-5-3-2">
<p>
We are performing cleanup here, this is optional. We are cleaning up the dangling images and images older than 2 days:
</p>

<pre class="example">
stage('Cleanup'){
    steps{
        sh '''
        docker rmi $(docker images -f 'dangling=true' -q) || true
        docker rmi $(docker images | sed 1,2d | awk '{print $3}') || true
        '''
    }

}
</pre>
</div>
</li>

<li><a id="sec-1-5-3-3" name="sec-1-5-3-3"></a>Building the Docker image<br  /><div class="outline-text-5" id="text-1-5-3-3">
<p>
In this step we build the image. We include the DOCKER<sub>REGISTRY</sub><sub>URL</sub> in the tag because we will push this image later to our docker registry.
</p>

<pre class="example">
sh '''
docker build -t ${DOCKER_REGISTRY_URL}/${DOCKER_PROJECT_NAMESPACE}/${IMAGE_NAME}:${RELEASE_TAG} --build-arg APP_NAME=${IMAGE_NAME}  -f app/Dockerfile app/.
'''
</pre>
</div>
</li>

<li><a id="sec-1-5-3-4" name="sec-1-5-3-4"></a>Publishing the image to Docker registry<br  /><div class="outline-text-5" id="text-1-5-3-4">
<p>
For this we need to use the username password credentials which we added . We login to docker registry first and publish the image to our docker registry. (registry.hub.docke.com in our case).
</p>

<pre class="example">
withCredentials([[$class: 'UsernamePasswordMultiBinding', credentialsId: "${JENKINS_DOCKER_CREDENTIALS_ID}", usernameVariable: 'DOCKER_USERNAME', passwordVariable: 'DOCKER_PASSWD']])
{
sh '''
echo $DOCKER_PASSWD | docker login --username ${DOCKER_USERNAME} --password-stdin ${DOCKER_REGISTRY_URL} 
docker push ${DOCKER_REGISTRY_URL}/${DOCKER_PROJECT_NAMESPACE}/${IMAGE_NAME}:${RELEASE_TAG}
docker logout
'''
}
</pre>
</div>
</li>

<li><a id="sec-1-5-3-5" name="sec-1-5-3-5"></a>Deploying to Google Cloud Platform Kubernetes Engine<br  /><div class="outline-text-5" id="text-1-5-3-5">
<p>
In this step we make use of Google Cloud Platform's gcloud cli to activate the service account.
We also make use of the JENKINS<sub>GCLOUD</sub><sub>CRED</sub><sub>ID</sub> secret file credential which we added to Jenkins credentials to get the Google cloud cluster credentials.
</p>

<p>
We have a utility script named process<sub>files</sub>.sh. This utility script replaces the variables which we pass as arguments. Below is how the utility script looks like:
</p>

<pre class="example">
#!/bin/bash

if (($# &lt;4))
  then
    echo "Usage : $0 &lt;DOCKER_PROJECT_NAME&gt; &lt;APP_NAME&gt; &lt;IMAGE_TAG&gt; &lt;directory containing k8s files&gt;"
    exit 1
fi

PROJECT_NAME=$1
APP_NAME=$2
IMAGE=$3
WORK_DIR=$4

main(){
find $WORK_DIR -name *.yml -type f -exec sed -i.bak1 's#__PROJECT_NAME__#'$PROJECT_NAME'#' {} \;
find $WORK_DIR -name *.yml -type f -exec sed -i.bak2 's#__APP_NAME__#'$APP_NAME'#' {} \;
find $WORK_DIR -name *.yml -type f -exec sed -i.bak3  's#__IMAGE__#'$IMAGE'#' {} \;
}
main
</pre>

<p>
Above utility script is placed next to our deployment , service and egress files. Once executed, it will process the files with requisite arguments.
</p>

<pre class="example">
stage('Deploy'){
    steps{
    withCredentials([file(credentialsId: "${JENKINS_GCLOUD_CRED_ID}", variable: 'JENKINSGCLOUDCREDENTIAL')])
    {
    sh """
        gcloud auth activate-service-account --key-file=${JENKINSGCLOUDCREDENTIAL}
        gcloud config set compute/zone asia-southeast1-a
        gcloud config set compute/region asia-southeast1
        gcloud config set project ${GCLOUD_PROJECT_ID}
        gcloud container clusters get-credentials ${GCLOUD_K8S_CLUSTER_NAME}

        chmod +x $BASE_DIR/k8s/process_files.sh

        cd $BASE_DIR/k8s/
        ./process_files.sh "$GCLOUD_PROJECT_ID" "${IMAGE_NAME}" "${DOCKER_PROJECT_NAMESPACE}/${IMAGE_NAME}:${RELEASE_TAG}" "./${IMAGE_NAME}/"

        cd $BASE_DIR/k8s/${IMAGE_NAME}/.
        kubectl apply -f $BASE_DIR/k8s/${IMAGE_NAME}/

        gcloud auth revoke --all
        """
    }
    }
}
</pre>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Conclusion</h3>
<div class="outline-text-3" id="text-1-6">
<p>
In this article we looked at how to containerize a simple static web application and continuously deploy it using Jenkins pipeline as code to Kubernetes cluster.
In the articles which follow we would take a look at how to:
</p>

<ul class="org-ul">
<li>Setup Continuous Deployment Pipelines of Java Maven Project to Kubernetes
</li>
<li>Setup Continuous Deployment Pipelines of Python (flask) project to Kubernetes
</li>
<li>Setup Continuous Deployment Pipelines of Nodejs (Angular5) project to Kubernetes
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-12-17 Mon 05:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
